{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "LlamaBiModel",
    "parent_library": "llm2vec.models.bidirectional_llama"
  },
  "base_model_name_or_path": "/home/xwj/Model/llama-3.1-8b-instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "up_proj",
    "k_proj",
    "down_proj",
    "gate_proj",
    "v_proj",
    "q_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}